Repository: nickyharpor/DomaBot
Catalog: translations/msg_*.po
Languages: ar, fr, ru

source: About
ar: حول
fr: À propos
ru: О нас

# about_1
source: DomaBot (Testnet) is created for DomainFi Challenge by Nicky Harpor
ar: دومابوت (اختبار الشبكة) تم إنشاؤه لتحدي دومين في من قبل نيكى هاربور
fr: DomaBot (Testnet) est créé pour le défi DomainFi par Nicky Harpor
ru: Домабот (Тестнет) создан для DomainFi Challenge Никки Харпором

# about_2
source: View submission at https://dorahacks.io/buidl/32851
ar: عرض المساهمة على https://dorahacks.io/buidl/32851
fr: Consultez la soumission sur https://dorahacks.io/buidl/32851
ru: Просмотреть подачу заявки по адресу: https://dorahacks.io/buidl/32851

# buy_domain
source: Buy / Make Offer
ar: الشراء/تقديم عرض
fr: Acheter / Faire une offre
ru: Купить / сделать предложение

# search_domain
source: Find Domains by Keyword
ar: ابحث عن النطاقات حسب الكلمة الرئيسية
fr: Trouver des domaines par mot-clé
ru: Найти домены по ключевому слову

source: Find Domains by Owner
ar: إيجاد نطاقات حسب المالك
fr: Rechercher des domaines par propriétaire
ru: Найти домены по владельцу

source: Get Recent Listing
ar: احصل على الإعلانات الأخيرة
fr: Obtenir les dernières annonces
ru: Получить последние объявления

# get_recent_offers
source: View Offers
ar: عرض العروض
fr: Voir les offres
ru: Просмотр предложений

# manage_subscription
source: Manage Subscriptions
ar: إدارة الاشتراكات
fr: Gérer les abonnements
ru: Управление подписками

# manage_subscription_1
source: Here are your subscriptions
ar: هذه اشتراكاتك
fr: Voici vos abonnements
ru: Здесь Ваши подписки

# manage_subscription_2
source: Select a subscription to change or remove it
ar: اختر اشتراكًا لتغييره أو حذفه
fr: Sélectionnez un abonnement pour le modifier ou le supprimer
ru: Выберите подписку, которую нужно изменить или удалить

# manage_subscription_x1
source: You don't have any subscriptions yet
ar: لم تقم بعد بأي اشتراكات
fr: Vous n'avez pas encore d'abonnements
ru: У вас пока нет подписок

# manage_subscription_x2
source: Find a domain name to subscribe to its events
ar: ابحث عن اسم نطاق للاشتراك في فعالياته
fr: Trouvez un nom de domaine pour vous abonner à ses événements
ru: Найти доменное имя для подписки на его мероприятия

source: Remove Subscription
ar: إلغاء الاشتراك
fr: Annuler l'abonnement
ru: Удалить подписку

# remove_subscription_1
source: Domain removed from your subscription list
ar: تم إزالة النطاق من قائمة اشتراكاتك
fr: Votre domaine a été supprimé de votre liste d'abonnements
ru: Домен удалён из вашего списка подписок

# remove_subscription_2
source: Domain has already been removed from subscription list
ar: تم إزالة النطاق بالفعل من قائمة الاشتراك
fr: Le domaine a déjà été retiré de la liste d'abonnement
ru: Домен уже удалён из списка подписок

# info_subscription_1
source: You have selected
ar: لقد قمت باختيار
fr: Vous avez sélectionné
ru: Вы выбрали

# info_subscription_2
source: What do you want to do
ar: ماذا تريد أن تفعل
fr: Que voulez-vous faire
ru: Что ты хочешь сделать?

# ai_consult
source: AI Domain Name Consultant
ar: استشاري أسماء نطاقات الذكاء الاصطناعي
fr: Consultant en nom de domaine IA
ru: Консультант по доменным именам в области ИИ

# ai_consult_1
source: Describe your business or personal project for AI to help you find the best domain names
ar: اشرح مشروعك التجاري أو الشخصي لكي تساعدك الذكاء الاصطناعي في إيجاد أفضل أسماء النطاقات
fr: Décrivez votre activité ou projet personnel pour que l'IA vous aide à trouver les meilleurs noms de domaine
ru: Опишите свой бизнес или личный проект, чтобы искусственный интеллект помог вам найти лучшие доменные имена

# ai_consult_2
source: For example, you can prompt
ar: على سبيل المثال، يمكنك أن تطلب
fr: Par exemple, vous pouvez demander à Coral de traduire des phrases en utilisant le format suivant
ru: Например, вы можете ввести

# ai_consult_3
source: Suggest modern and youthful domain names for my gaming accessories online shop
ar: اقترح أسماء نطاقات حديثة وشابة لمجموعة ألعابي لمتجر الألعاب عبر الإنترنت
fr: Propose des noms de domaine modernes et jeunes pour ma boutique en ligne d'accessoires de jeux vidéo
ru: Предложите современные и молодежные доменные имена для моего онлайн-магазина игровой атрибутики

# ai_is_searching_1
source: AI is searching Doma Testnet for best domain names based on your description
ar: يقوم الذكاء الاصطناعي بالبحث في شبكة اختبار `دوما` عن أفضل أسماء النطاقات بناءً على وصفك
fr: L'IA recherche sur le testnet Doma les meilleurs noms de domaine en fonction de votre description
ru: Искусственный интеллект ищет на тестовой сети Doma лучшие доменные имена, соответствующие вашему описанию

# ai_is_searching_2
source: Please be patient, it can take a while
ar: يرجى التحلي بالصبر، فقد يستغرق الأمر بعض الوقت
fr: Soyez patient, cela peut prendre un certain temps
ru: Пожалуйста, подождите, это может занять некоторое время

source: Settings
ar: الإعدادات
fr: Paramètres
ru: Настройки

source: Change Language
ar: غير اللغة
fr: Changer de langue
ru: Изменить язык

# change_language_1
source: Select a language
ar: اختر لغة
fr: Sélectionnez une langue
ru: Выберите язык

# change_language_2
source: Your language changed
ar: لقد تغيرت لغتك
fr: Votre langue a changé
ru: Ваш язык изменился

source: English
ar: الإنجليزية
fr: Anglais
ru: Английский

source: Spanish
ar: الإسبانية
fr: Espagnol
ru: Испанский

source: French
ar: الفرنسية
fr: Français
ru: Французский

source: Portuguese
ar: البرتغالية
fr: Portugais
ru: Португальский

source: Russian
ar: الروسية
fr: Russe
ru: Русский

source: Arabic
ar: عَرَبِيّ
fr: عربي
ru: арабский

source: Main Menu
ar: القائمة الرئيسية
fr: Menu principal
ru: Главное меню

# last_week_domains
source: Domains listed recently
ar: الأسماء المستعارة المسجلة مؤخرًا
fr: Domaines répertoriés récemment
ru: Домены, зарегистрированные недавно

# enter_a_filter_string_1
source: Enter a filter string to search
ar: أدخل سلسلة تصفية للبحث
fr: Entrez une chaîne de filtrage pour la recherche
ru: Введите строку фильтра для поиска

# enter_a_filter_string_2
source: For example, `doma` will find `doma.com` and `mydoma.ai` and every other domain with `doma` in it
ar: على سبيل المثال، ستجد `doma` كل نطاقات `doma.com` و `mydoma.ai`، وغيرها من النطاقات التي تحتوي على كلمة `doma`
fr: Par exemple, `doma` trouvera `doma.com` et `mydoma.ai` ainsi que tous les autres domaines qui contiennent `doma`
ru: Например, `doma` найдет `doma.com`, `mydoma.ai` и любой другой домен с `doma` внутри

# enter_a_caip10_address_1
source: Enter the owner wallet address in CAIP-10 format
ar: أدخل عنوان محفظة المالك بتنسيق CAIP-10
fr: Entrez l'adresse du portefeuille de l'utilisateur dans le format CAIP-10
ru: Введите адрес кошелька владельца в формате CAIP-10

# enter_a_caip10_address_2
source: For example, for Ethereum Mainnet `eip155:1:0xab16a96D359eC26a11e2C2b3d8f8B8942d5Bfcdb` is an address in CAIP-10 format
ar: على سبيل المثال، بالنسبة للشبكة الرئيسية لـ Ethereum `eip155:1:0xab16a96D359eC26a11e2C2b3d8f8B8942d5Bfcdb` هو عنوان بتنسيق CAIP-10
fr: Par exemple, pour le réseau principal Ethereum `eip155:1:0xab16a96D359eC26a11e2C2b3d8f8B8942d5Bfcdb` est une adresse au format CAIP-10
ru: Для примера, для Ethereum Mainnet `eip155:1:0xab16a96D359eC26a11e2C2b3d8f8B8942d5Bfcdb` является адресом в формате CAIP-10

# list_domains_text
source: domains found
ar: المناطق الموجودة
fr: domaines trouvés
ru: доменов найдено

source: Next
ar: التالي
fr: Suivant
ru: Далее

source: Previous
ar: السابق
fr: Précédent
ru: Предыдущий

source: Last
ar: الجزء الأخير
fr: Dernier
ru: Последний

source: First
ar: الأول
fr: Premier
ru: Первый

source: from
ar: من
fr: de
ru: от

# searching
source: Searching for
ar: بحث عن
fr: Recherche en cours
ru: Поиск

source: View on Explorer
ar: عرض على المستكشف
fr: Afficher sur Explorer
ru: Посмотреть в Eksplore'e

source: View Recent Activities
ar: عرض الأنشطة الأخيرة
fr: Voir les dernières activités
ru: Просмотр недавних действий

source: Subscribe
ar: اشترك
fr: S'abonner
ru: Подписаться

source: Domain
ar: النطاق
fr: domaine
ru: Домен

source: Chain
ar: سلسلة
fr: chaîne
ru: Кольцо

source: ID
ar: هوية
fr: Identifiant
ru: Идентификатор

source: Owner
ar: المالك
fr: Propriétaire
ru: Владелец

source: Tokenized at
ar: تم توكنيزه في
fr: Tokenisé à
ru: Токенизировано в

source: Expires at
ar: تنتهي صلاحيتها في
fr: Expire à
ru: Срок действия истекает

source: Claimed by
ar: مُطالَب به
fr: Reclamé par
ru: Заявлен

source: Event
ar: حدث
fr: événement
ru: Событие

source: Status
ar: الحالة
fr: État
ru: Состояние

# tx_hash
source: Transaction Hash
ar: كلمة المعاملة
fr: Chiffre de la transaction
ru: Хэш транзакции

source: Event Time
ar: وقت الحدث
fr: Heure de l'événement
ru: Событие в реальном времени

source: Recent activities
ar: الأنشطة الأخيرة
fr: Activités récentes
ru: Последние действия

# sub_added
source: Domain name added to your subscription list
ar: أضفنا اسم النطاق إلى قائمة الاشتراكات الخاصة بك.
fr: Nom de domaine ajouté à votre liste d'abonnement
ru: Домен добавлен в ваш список подписок

# sub_already_existed
source: Domain name is already in your subscription list
ar: اسم النطاق موجود بالفعل في قائمة اشتراكك
fr: Le nom de domaine est déjà dans votre liste d'abonnement
ru: Доменное имя уже находится в вашем списке подписок

# main_menu_1
source: Welcome to DomaBot
ar: مرحبا بك في دومابات
fr: Bienvenue sur DomaBot
ru: Добро пожаловать в Домабот

# main_menu_2
source: What do you want to do
ar: ماذا تريد أن تفعل
fr: Que voulez-vous faire
ru: Что ты хочешь сделать

# new_event_alert
source: New event alert for
ar: تنبيه حدث جديد ل
fr: Alerte de nouvel événement pour
ru: Уведомление о новой události для
